In [1]:
# module import
import pandas as pd # DF 처리할 때 사용
import numpy as np # nan값 처리할 때 사용
import seaborn as sns # 시각화 
import matplotlib.pyplot as plt #시각화
%matplotlib inline

이번에 전처리 하고 분석해야 할 내용은 '타이타닉' 입니다.
타이타닉 사건은 1912년 영국 Southhampton에서 출발해 미국 뉴욕으로 항해 도중 약 2,224명 탑승객 중 1,500명 이상이 사망한
사건입니다. 당시 타이타닉은 부유층들과 아메리칸 드림을 꿈꾸는 사람들까지 모두 태우고 있어서 더욱더 안타까운 사건입니다.
타이타닉의 이동은 Southhampton을 출발한 후, 프랑스의 Cherbourg, 아일랜드의 Queenstown에 정박, 이후 뉴욕으로 출발합니다.
하지만 타이타닉호는 선체의 우현에 빙하와 충돌한 후, 바닷물에 노출되었습니다.
당시 1912년 배경과, 타이타닉의 구명정 탑승 규칙인 '여성과 아이들 먼저 (ladies and child first)' 로 많은 남성들은
구명정을 타지 못하고 높은 확률로 사망하였습니다.

타이타닉은 총 10층으로 구성되어 층별로 다른 시설들이 존재했다고 합니다.

- 최상층에 위치한 The Boat Deck. 구명정이 설치되어 있던 층이며, 합교,조타실, 선장실이 있던 층입니다.
- 1등실의 산책로, 객실, 라운지, 등등 1등실 승객만을 위한 층인 'A deck',
- 1등실의 개인 산책로와 초호화객실 'B deck',
- 1등실의 대다수 객실과 2등실의 도서관, 3등실의 산책로와 선원의 숙소, 3등실 승객의 라운지로 여러가지가 존재한 'C deck',
- 1등실 연회실, 식당, 2등실 식당으로 구성된 'D deck'
- 2등실의 승객과 선원들의 객실이 포함된 'E deck'
- 2,3등실 객실과 선원 생활공간, 3등실 식당이 포함된 'F deck'
- 선원 및 승객들이 사용하는 다양한 생활공간인 'G deck'
- |최하층 갑판인 'Orlop Deck'
- 그 아래 보일러, 엔진 시설이 있는 'Tank Top'

타이타닉의 경우 '3등실' 이용객들을 배의 양 끝에 나누어서 타게 하고, 
1인 남성승객은 배의 앞쪽에, 1인 여성승객과 결혼한 커플, 가족들은 뒤로 타게하여 프라이버시를 위한 분리조치를 실행했습니다.

    DATA LOADING

In [2]:
raw_data = pd.read_csv('../Data/train.csv')
data = raw_data.copy() # copy를 사용해서 raw_data를 변경하지 않도록!
data.head() # data 형태를 확인해봅시다.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data.info() # data의 정보 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

data 는 총 891 x 12 dataframe 형태를 가지고 있습니다. 
12개의 컬럼은 병합 혹은 분할을 통해서 가치있는 열을 찾아야 할 것 입니다

    데이터 처리 과정에서 가장 첫번째로 고민해야 할 부분은 '결측값'처리 인 것 같습니다.
    data의 열(columns)에 결측값이 있는지 확인해봅시다.

In [4]:
data.isnull().sum() #data에 null값이 있으면 1로 반환하고 더합니다.

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

- Age 값과 Cabin , Embared 열에는 결측값이 많이 존재합니다.
- 특히 Cabin의 경우 결측값이 상대적으로 훨씬 많기 때문에 결측값 처리 기준을 잘 세워야 할 것 같습니다.
  그게 아니라면 제거하는 것도 방법일 것 같습니다.
- Embarked 열의 경우에는 2개의 결측값이 있고, 이 값들은 총 891개의 값 중 2개 ffill/bfill 등을 이용해
  결측값을 처리해도 크게 문제되지 않을 것 같습니다.